## **[MySQL GROUP BY](https://www.mysqltutorial.org/mysql-group-by.aspx)**

Use MySQL GROUP BY to group rows into subgroups based on values of columns or expressions.

The difference between DISTINCT clause and GROUP BY clause is that the GROUP BY clause sorts the result set, whereas the DISTINCT clause does not.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL GROUP BY clause

syntax:

SELECT 
    c1, c2,..., cn, aggregate_function(ci)
FROM
    table
WHERE
    where_conditions
GROUP BY c1 , c2,...,cn;

In [3]:
SVG('../images/MySQL-Group-By.svg')

### MySQL GROUP BY examples

#### A) Simple MySQL GROUP BY example

In [4]:
# group values of the orders's status into subgroups
string = '''
SELECT status
FROM orders
GROUP BY status
;'''

pd.read_sql(string, engine)

       status
0     Shipped
1    Resolved
2   Cancelled
3     On Hold
4    Disputed
5  In Process

In [5]:
# distinct is as same as group by
string = '''
SELECT DISTINCT status
FROM orders
;'''

pd.read_sql(string, engine)

       status
0     Shipped
1    Resolved
2   Cancelled
3     On Hold
4    Disputed
5  In Process

In [6]:
(pd.read_sql_table('orders', engine)
 [['status']]
 .drop_duplicates(ignore_index=True)
)

       status
0     Shipped
1    Resolved
2   Cancelled
3     On Hold
4    Disputed
5  In Process

#### B) Using MySQL GROUP BY with aggregate functions

In [7]:
# the number of orders in each status
string = '''
SELECT status, COUNT(*) AS count
FROM orders
GROUP BY status
ORDER BY count DESC, status 
;'''

df1 = pd.read_sql(string, engine)

In [8]:
df2 = (
    pd.read_sql_table('orders', engine)
    .value_counts(subset='status')
    .rename('count')
    .reset_index()
    .sort_values(
        by=['count', 'status'], ascending=[False, True])
)

In [9]:
df1.equals(df2)

True

In [10]:
df1

       status  count
0     Shipped    303
1   Cancelled      6
2  In Process      6
3     On Hold      4
4    Resolved      4
5    Disputed      3

In [11]:
# the total amount of all orders by status
string = '''
SELECT
    status,
    SUM(quantityOrdered * priceEach) AS amount
FROM orders
INNER JOIN orderdetails USING (orderNumber)
GROUP BY status
ORDER BY amount DESC
;'''

df1 = pd.read_sql(string, engine)

In [12]:
df2 = (
    pd.merge(left=pd.read_sql_table('orders', engine),
             right=pd.read_sql_table('orderdetails', engine),
             on='orderNumber', how='inner')
    .assign(amount = lambda df: df['quantityOrdered'] * df['priceEach'])
    .groupby('status', as_index=False)
    .amount.sum()
    .sort_values('amount', ascending=False)
    .reset_index(drop=True)
)

In [13]:
df1.equals(df2)

False

In [14]:
(df1 != df2).sum()

status    0
amount    1
dtype: int64

In [15]:
(df1.amount - df2.amount).abs().sum()

2.9103830456733704e-11

In [16]:
df1

       status      amount
0     Shipped  8865094.64
1   Cancelled   238854.18
2     On Hold   169575.61
3  In Process   135271.52
4    Resolved   134235.88
5    Disputed    61158.78

In [17]:
# returns the orderNumber and the total amount of each other
string = '''
SELECT
    orderNumber,
    SUM(quantityOrdered * priceEach) AS total
FROM orderdetails
GROUP BY orderNumber
;'''

df1 = pd.read_sql(string, engine)

In [18]:
df2 = (
    pd.read_sql_table('orderdetails', engine)
    .assign(total = lambda df: df['quantityOrdered'] * df['priceEach'])
    .groupby(by='orderNumber', as_index=False)
    .agg({'total': 'sum'})
)
df1.equals(df2)

False

In [19]:
(df1 != df2).sum()

orderNumber     0
total          39
dtype: int64

In [20]:
(df1.total - df2.total).abs().sum()

1.559783413540572e-10

In [21]:
df1.head()

   orderNumber     total
0        10100  10223.83
1        10101  10549.01
2        10102   5494.78
3        10103  50218.95
4        10104  40206.20

#### C) MySQL GROUP BY with expression example

In [22]:
# Group rows by expressions. Gets the total sales for each year
string = '''
SELECT
    YEAR(orderDate) AS year,
    SUM(quantityOrdered * priceEach) as total_shipped
FROM orders
INNER JOIN orderdetails USING (orderNumber)
WHERE status = 'Shipped'
GROUP BY
    YEAR(orderDate)
    # year
;'''

df1 = pd.read_sql(string, engine)

In [23]:
df2 = (
    pd.read_sql_table('orders', engine)
    .merge(pd.read_sql_table('orderdetails', engine),
           on='orderNumber', how='inner')
    .query("status == 'Shipped'")
    .assign(total_shipped = lambda df: df.quantityOrdered * df.priceEach,
            year = lambda df: df.orderDate.dt.year)
    .groupby('year', as_index=False)
    .agg({'total_shipped': 'sum'})
)

In [24]:
df1.equals(df2)

True

In [25]:
df1

   year  total_shipped
0  2003     3223095.80
1  2004     4300602.99
2  2005     1341395.85

#### D) Using MySQL GROUP BY with HAVING clause example

In [26]:
# select the total sales of the years after 2003
string = '''
SELECT
    YEAR(orderDate) AS year,
    SUM(quantityOrdered * priceEach) AS total_shipped
FROM orders
INNER JOIN orderdetails USING(orderNumber)
WHERE status = 'Shipped'
GROUP BY year
HAVING year > 2003
;'''

# same as
string1 = '''
SELECT
    YEAR(orderDate) AS year,
    SUM(quantityOrdered * priceEach) AS total_shipped
FROM orders
INNER JOIN orderdetails USING(orderNumber)
WHERE status = 'Shipped' AND YEAR(orderDate) > 2003
GROUP BY year
;'''

df1 = pd.read_sql(string, engine)

# df1 = pd.read_sql(string1, engine)

In [27]:
df2 = (
    pd.read_sql_table('orders', engine)
    .merge(pd.read_sql_table('orderdetails', engine), 
           on='orderNumber', how='inner')
    .assign(year = lambda df: df.orderDate.dt.year,
            total_shipped = lambda df: df.quantityOrdered * df.priceEach)
    .query("status == 'Shipped' and year > 2003")
    .groupby('year', as_index=False)
    .agg({'total_shipped': 'sum'})
)

In [28]:
df1.equals(df2)

True

In [29]:
df1

   year  total_shipped
0  2004     4300602.99
1  2005     1341395.85

### The GROUP BY clause: MySQL vs. SQL standard

SQL does not allow you to use an alias in the `group by` clause whereas MySQL supports this.

In [30]:
string = '''
SELECT 
    YEAR(orderDate) AS year, 
    COUNT(orderNumber) AS number_order
FROM orders
GROUP BY year
;'''

df1 = pd.read_sql(string, engine)

In [31]:
df2 = (
    pd.read_sql_table('orders', engine)
    .assign(year = lambda df: df.orderDate.dt.year)
    .groupby('year', as_index=False)
    .agg(number_order = pd.NamedAgg(
        column='orderNumber', aggfunc='size'))
)

In [32]:
df1.equals(df2)

True

In [33]:
df1

   year  number_order
0  2003           111
1  2004           151
2  2005            64

MySQL does not allow you to sort the groups.

string = '''
SELECT 
    status, 
    COUNT(*)
FROM
    orders
GROUP BY 
    status DESC
;'''

pd.read_sql(string, engine)

### The GROUP BY clause vs. DISTINCT clause

In [34]:
string = '''
SELECT state
FROM customers
GROUP BY state
;'''

pd.read_sql(string, engine).head()

      state
0      None
1        NV
2  Victoria
3        CA
4        NY

In [35]:
string = '''
SELECT DISTINCT state
FROM customers
;'''

pd.read_sql(string, engine).head()

      state
0      None
1        NV
2  Victoria
3        CA
4        NY